# SetFormula Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..SetFormula Method
FamilyManager Class See Also
---
Set the formula of a family parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetFormula(
	FamilyParameter familyParameter,
	string formula
)
```

Visual Basic
---
```text
Public Sub SetFormula ( _
	familyParameter As FamilyParameter, _
	formula As String _
)
```

Visual C++
---
```text
public:
void SetFormula(
	FamilyParameter^ familyParameter,
	String^ formula
)
```

# ### Parameters
familyParameter
    Type: Autodesk.Revit.DB..::..FamilyParameterThe family parameter.
formula
    Type: System..::..StringThe formula string, input nullNothingnullptra null reference (Nothing in Visual Basic) to clean the formula of the parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument-"familyParameter"-is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when there is no valid family type, or the parameter cannot be assigned a formula, or the operation make a circular chain of references among the formulas. |

# See Also
FamilyManager Class
Autodesk.Revit.DB Namespace